Revit 2027 API
ElectricalSystemType Enumeration
 An enumerated type listing all the possible electrical system types for a connector object.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ElectricalSystemType
Public Enumeration ElectricalSystemType
public enum class ElectricalSystemType
type ElectricalSystemType
Members
Member name | Value | Description
Communication | 14 |  Electrical System Type is Communication.
Controls | 13 |  Electrical System Type is Controls.
Data | 5 |  Electrical System Type is Data.
FireAlarm | 11 |  Electrical System Type is FireAlarm
NurseCall | 12 |  System Type is NurseCall.
PowerBalanced | 30 |  Electrical System Type is PowerBalanced.
PowerCircuit | 6 |  Electrical System Type is PowerCircuit.
PowerUnBalanced | 31 |  Electrical System Type is PowerUnBalanced.
Security | 10 |  Electrical System Type is Security
Telephone | 9 |  Electrical System Type is Telephone.
UndefinedSystemType | 0 |  Undefined system type
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace